In [1]:
!pip3 install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/99/f7/01cea7f6c963100f045876eb4aa1817069c5c9eca73d2dbfb5d31ff9a39f/pandas-1.3.0-cp37-cp37m-manylinux_2_5_x86_64.manylinux1_x86_64.whl (10.8MB)
    100% |████████████████████████████████| 10.8MB 132kB/s ta 0:00:011   11% |███▉                            | 1.3MB 8.8MB/s eta 0:00:02    38% |████████████▎                   | 4.1MB 28.9MB/s eta 0:00:01    45% |██████████████▍                 | 4.9MB 14.7MB/s eta 0:00:01    52% |████████████████▉               | 5.7MB 6.4MB/s eta 0:00:01
Requirement already satisfied: pytz>=2017.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/lib/python3/dist-packages (from pandas) (2.7.3)
Collecting numpy>=1.17.3 (from pandas)
  Downloading https://files.pythonhosted.org/packages/b8/46/3f1a1a1f5fa3c0325a407a98396b8ac90e4eaa058420668b4b640729c784/numpy-1.21.1-cp37-cp37m-manylinux_2_5_x86_64.manylinux1_x86_64.whl (14.1MB)
    100% |████████████████████████████████| 14.1MB 113kB/s ta 0:00:01
Installing collected packages: numpy, pandas
Successfully installed numpy-1.21.1 pandas-1.3.0

In [3]:
import pandas as pd
print(pd.__version__)

1.3.0

## Seriesの作成
nameはOptional

In [ ]:
s = pd.Series([1, 2, 3], name="s")
s

# Dataframe作成

In [7]:
df = pd.DataFrame({
    "A": ["a", "b", "a"],
    "B": [1, 3, 5],
    "C": [10, 11, 12],
    "D": [2, 4, 6]
})
df

   A  B   C  D
0  a  1  10  2
1  b  3  11  4
2  a  5  12  6

# 列選択

In [5]:
df["A"]

   A  B
0  a  1
1  b  3
2  a  5

In [6]:
df[["A", "B"]]

   A  B
0  a  1
1  b  3
2  a  5

## 条件に応じた列選択

In [10]:
df.loc[:, [c.startswith("A") for c in df.columns]]
df.loc[:, df.columns.str.startswith("A")]

   A
0  a
1  b
2  a

In [ ]:
## 列の入れ替え

In [11]:
df[["B", "A"]]

   B  A
0  1  a
1  3  b
2  5  a

## 列の追加

In [14]:
df["E"] = df["B"] * 2
df["F"] = df["B"].map(lambda x: x * 2)
df = df.assign(G = lambda df: df.B * 2)
df

   A  B   C  D   E   F   G
0  a  1  10  2   2   2   2
1  b  3  11  4   6   6   6
2  a  5  12  6  10  10  10

## 条件による行選択

### 単独条件

In [20]:
df.loc[df["B"] <= 4]
df.query("B <= 4")

   A  B   C  D  E  F  G
0  a  1  10  2  2  2  2
1  b  3  11  4  6  6  6

複数条件

In [22]:
df.loc[(df["B"] == 1) | (df["C"] == 12)]
df.query("B == 1 | C == 12")

   A  B   C  D   E   F   G
0  a  1  10  2   2   2   2
2  a  5  12  6  10  10  10

### 含まれているかなどの演算

In [33]:
l = [1, 3]
df.query("B in @l")

   A  B   C  D  E  F  G
0  a  1  10  2  2  2  2
1  b  3  11  4  6  6  6

## 重複行の抽出

In [26]:
df.loc[df.duplicated()]

Empty DataFrame
Columns: [A, B, C, D, E, F, G]
Index: []

## 重複行の削除

In [30]:
df.loc[3] = df.loc[2]
df

   A  B   C  D   E   F   G
0  a  1  10  2   2   2   2
1  b  3  11  4   6   6   6
2  a  5  12  6  10  10  10
3  a  5  12  6  10  10  10

In [31]:
df.drop_duplicates()

   A  B   C  D   E   F   G
0  a  1  10  2   2   2   2
1  b  3  11  4   6   6   6
2  a  5  12  6  10  10  10

## numpyへの変換

In [35]:
df.values

array([['a', 1, 10, 2, 2, 2, 2],
       ['b', 3, 11, 4, 6, 6, 6],
       ['a', 5, 12, 6, 10, 10, 10],
       ['a', 5, 12, 6, 10, 10, 10]], dtype=object)

## Groupby

In [43]:
dates = [
"2020-08-21",
"2020-08-21",
"2020-08-22",
"2020-08-23",
"2020-08-22",
]

temp = [20, 10, 7, 9, 1]
rain = [0.2, 0.1, 0.3, 0.1, 0.01]

d = dict(
    date=dates,
    temp=temp,
    rain=rain
)

df = pd.DataFrame.from_dict(d)

### build-inの演算

In [48]:
df.groupby("date").var()

            temp     rain
date
2020-08-21  50.0  0.00500
2020-08-22  18.0  0.04205
2020-08-23   NaN      NaN

In [50]:
df.groupby("date")[["temp"]].sum()

            temp
date
2020-08-21    30
2020-08-22     8
2020-08-23     9

In [51]:
import numpy as np

In [57]:
# 複数の演算をまとめて
df.groupby("date").agg({"temp": [np.mean, np.var], "rain": [np.std]})

            temp            rain
            mean   var       std
date
2020-08-21  15.0  50.0  0.070711
2020-08-22   4.0  18.0  0.205061
2020-08-23   9.0   NaN       NaN

### 任意の演算

In [59]:
df.groupby("date").agg(lambda x: print(x))

0    20
1    10
Name: temp, dtype: int64
2    7
4    1
Name: temp, dtype: int64
3    9
Name: temp, dtype: int64
0    0.2
1    0.1
Name: rain, dtype: float64
2    0.30
4    0.01
Name: rain, dtype: float64
3    0.1
Name: rain, dtype: float64

            temp  rain
date
2020-08-21  None  None
2020-08-22  None  None
2020-08-23  None  None

In [58]:
df.groupby("date").apply(lambda x: print(x))

         date  temp  rain
0  2020-08-21    20   0.2
1  2020-08-21    10   0.1
         date  temp  rain
2  2020-08-22     7  0.30
4  2020-08-22     1  0.01
         date  temp  rain
3  2020-08-23     9   0.1

Empty DataFrame
Columns: []
Index: []

## vstack, hstack

In [60]:
df1 = pd.DataFrame({"A": [1, 2, 3], "B": [2, 3, 4]})
df1_t = pd.DataFrame({"A": [4, 5, 6], "B": [5, 6, 7]})
df2 = pd.DataFrame({"C": ["a", "b", "c"], "D": [0.1, 0.2, 0.3]})
s1 = pd.Series([10, 11, 12], name="s1")
s2 = pd.Series(["ABC", "NMK", "XYZ"], name="s2")

In [62]:
# hstack
pd.concat([df1, s1, s2], axis=1)

   A  B  s1   s2
0  1  2  10  ABC
1  2  3  11  NMK
2  3  4  12  XYZ

In [63]:
pd.concat([df1, df2], axis=1)

   A  B  C    D
0  1  2  a  0.1
1  2  3  b  0.2
2  3  4  c  0.3

In [64]:
# vstack
pd.concat([df1, df1_t])

   A  B
0  1  2
1  2  3
2  3  4
0  4  5
1  5  6
2  6  7

In [65]:
pd.concat((df1, df2))

     A    B    C    D
0  1.0  2.0  NaN  NaN
1  2.0  3.0  NaN  NaN
2  3.0  4.0  NaN  NaN
0  NaN  NaN    a  0.1
1  NaN  NaN    b  0.2
2  NaN  NaN    c  0.3